BEGIN TRANSACTION;

INSERT INTO logistics.customer (firstname, lastname, patronymic, address, telephone,email,hashcode, admin, manager)
	VALUES ('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust1@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust2@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust3@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust4@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust5@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust6@gmail.com', ' ,�b�Y[�K-#Kp', false, false),
('Иван', 'Иванов', 'Иванович', 'Молодежная, дом5', '8(927)124-15-25','admin@gmail.com', ' ,�b�Y[�K-#Kp', true, false),
('Дмитрий', 'Сергеев', 'Нефедович', 'Молодежная, дом5', '8(927)124-15-25','manager@gmail.com',' ,�b�Y[�K-#Kp',  false, true);	
	
INSERT INTO logistics.transport (variety, avSpeed, maxHeight, maxWidth, maxLength, totalWeight, totalCapacity) 
             VALUES ( 'Грузовой', '60', '2.5', '2', '15', '10000', '75'), 
              ( 'Воздушный', '500', '3', '3', '20', '10000', '180'),
              ( 'ЖД транспорт', '50', '5', '3', '20', '20000', '300');

INSERT INTO logistics.rate (name,costshipping,additionalcost,costkm,startactiondate,endactiondate,transport_id)
		VALUES ('Апрельский',11.0,15.0,40.0,{d '2018-04-01'},{d '2018-05-01'},1),
  			('Апрельский',11.0,15.0,150.0,{d '2018-04-01'},{d '2018-05-01'},2),
  			('Апрельский',11.0,150,30.0,{d '2018-04-01'},{d '2018-05-01'},3),
  			('Майский',10.0,12.0,150.0,{d '2018-05-01'},{d '2018-06-01'},1),
  			('Майский',10.0,12.0,30.0,{d '2018-05-01'},{d '2018-06-01'},2),
  			('Майский',10.0,12.0,150.0,{d '2018-05-01'},{d '2018-06-01'},3);

insert into logistics.boxing (variety, cost) VALUES ('Стандартная', '100'),
('Для хрупких грузов', '500'),
('Водонепроницаемая', '400'),
('Холодильный контейнер', '1000');		

INSERT INTO logistics.node (name, city, address, coordinatex, coordinatey, code) 
             VALUES ( 'Московский', 'Москва', 'Улица Адмирала Руднева, д.10', '55.755773', '37.617761', '1'),
               	( 'Уфимский', 'Уфа', 'Авангардная улица, д.11', '54.734768', '55.957838', '2'),
               	( 'Хабаровский', 'Хабаровск', 'Улица Авиаконструктора Микояна, д.12', '48.472584', '135.057732', '3'),
               	( 'Тверской', 'Тверь', 'Уршакская улица, д.16', '56.859611', '35.911896', '4'),
               	( 'Самаровский', 'Самара', 'Ухтомского переулок, д.15', '53.195533', '50.101801', '5'),
               	( 'Рязанский', 'Рязань', 'Тельмана Эрнста площадь, д.2', '54.619886', '39.744954', '6'),
               	( 'Псковский', 'Псков', 'Тимирязевская улица, д.7', '57.819365', '28.331786', '7'),
               	( 'Ростовский', 'Ростов-на-Дону', 'Тихая улица, д.24а', '47.227151', '39.744972', '8'),
               	( 'Омский', 'Омск', 'Ткацкая улица, д.10', '54.989342', '73.368212', '9'),
               	( 'Воронежский', 'Воронеж', 'Трехгорный Большой переулок, д.4', '51.661535', '39.200287', '10'),
               	( 'Владивостокский', 'Владивосток', 'Трехсвятительский Большой переулок, д.1', '43.134019', '131.928379', '11'),
               	( 'Новгородский', 'Великий Новгород', 'Трехпрудный переулок, д.2', '58.521475', '31.275475', '12'),
               	( 'Благовещенский', 'Благовещенск', 'Трубецкая улица, д.6', '50.290658', '127.527173', '13'),
               	( 'Архангельский', 'Архангельск', 'Тюленева Генерала улица, д.10', '64.539304', '40.518735', '14'),
               	( 'Томский', 'Томск', 'Тюрина улица, д.13', '56.495116', '84.972128', '15'),
               	( 'Симферопольский', 'Симферополь', 'Ленивка улица, д.8', '44.952116', '34.102411', '16');

insert into logistics.transport_node (node_id, transport_id) VALUES 
													(1, 2),
													(1, 3),
													(2, 3),
													(7, 2),
													(8, 2),
													(8, 3),
													(10, 3),
													(12, 2),
													(13, 2),
													(13, 3);

insert into logistics.distance (length, node_id_start, node_id_end) VALUES 
														(467, 1, 10),
														(6142, 1, 3),
														(959, 1, 8),
														(5205, 2, 3),
														(1270, 2, 4),
														(990, 4, 5),
														(344, 4, 6),
														(697, 5, 6),
														(788, 6, 7),
														(189, 7, 12),
														(1485, 7, 16),
														(2476, 8, 9),
														(2276, 9, 10),
														(4324, 9, 11),
														(6563, 10, 11),
														(6038, 11, 12),
														(4988, 13, 14),
														(2528, 14, 15),
														(2215, 14, 16),
														(3704, 15, 16);

INSERT INTO logistics.package (name, envelop, height, width, length, weight, quantity, size) VALUES ('31','0','0.7','0.5','0.3','6.7', '1','1'),
																('12','0','0.2','0.1','0.05','4.1', '1','1'),
																('13','0','0.2','0.2','0.3','4.5', '2','1'),
																('14','1','0','0','0','0', '2','0'),
																('15','0','0.6','0.7','0.2','9.4', '1','1'),
																('16','0','0.05','0.9','0.4','1.6', '2','1'),
																('17','1','0','0','0','0', '2','0'),
																('29','0','0.1','0.15','0.09','2.4', '2','1'),
																('21','0','1.1','0.4','0.3','14.1', '1','1'),
																('27','0','0.8','0.7','0.4','9.3', '2','1'),
																('26','1','0','0','0','0', '2','0'),
																('25','0','1','1','1','17.6', '2','1'),
																('24','0','0.2','0.3','0.1','1.2', '1','0.006'),
																('23','1','0','0','0','0', '2','0'),
																('22','1','0','0','0','0', '2','0'),
																('21','1','0','0','0','0', '2','0');

INSERT INTO logistics.order (name, urgency, ready, plan_date, real_date, cost, shipment_date, contact_information, full_path, 
	recipient_id, rate_id, package_id, boxing_id, node_start_id, node_target_id) VALUES 
('6f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '1 day',now() - interval '1 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - {Хабаровск','1','1','1',1,1,3),
('5f4f9685-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '1 day',now() - interval '1 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Ростов-на-Дону - Авто - Воронеж','1','1','2',1,8,10),
('5fdh4681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '1 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Ростов-на-Дону - Воздушная - Благовещенск','1','1','3',2,8,13),
('5f234y81-db50-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Омск - Авто - Владивосток','1','1','4',1,9,11),
('5f25h681-db50-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Воздушная - Ростов-на-Дону - Воздушная - Благовещенск','1','1','5',1,1,13),
('5ch5h681-d4jd-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Москва - Воздушная - Ростов-на-Дону - Воздушная - Благовещенск','1','1','6',2,1,13),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '1 day','3616', now() - interval '9 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','7',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','8',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '10 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','10',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','11',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '2 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '5 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','13',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '5 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','16',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '3 day','3616', now() - interval '3 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','1',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','2',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '3 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','3',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','4',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','5',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','6',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','7',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','8',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','10',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','11',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','13',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '5 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','16',1,1,2);

INSERT INTO logistics.order (name, urgency, ready, plan_date, cost, shipment_date, contact_information, full_path, 
	recipient_id, rate_id, package_id, boxing_id, node_start_id, node_target_id) VALUES 
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','1',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','2',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','3',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','4',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','5',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','6',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','7',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','2','1','8',2,1,2);
																
																           

COMMIT;

select * from logistics.node
