BEGIN TRANSACTION;

INSERT INTO logistics.customer (firstname, lastname, patronymic, address, telephone,email,hashcode, admin, manager)
	VALUES ('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Павел', 'Петров', 'Игоревич', 'Молодежная, дом5', '8(927)124-15-25','customer@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust1@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust2@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust3@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust4@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust5@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Сергей', 'Петров', 'Федорович', 'Молодежная, дом5', '8(927)124-15-25','cust6@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', false, false),
('Иван', 'Иванов', 'Иванович', 'Молодежная, дом5', '8(927)124-15-25','admin@gmail.com', 'gnzLDuqKcGxMNKFokfhOew==', true, false),
('Дмитрий', 'Сергеев', 'Нефедович', 'Молодежная, дом5', '8(927)124-15-25','manager@gmail.com','gnzLDuqKcGxMNKFokfhOew==',  false, true);	
	
INSERT INTO logistics.transport (variety, avSpeed, maxHeight, maxWidth, maxLength, totalWeight, totalCapacity) 
             VALUES ( 'Авто', '60', '2.5', '2', '15', '10000', '75'), 
              ( 'Воздушный', '500', '3', '3', '20', '10000', '180'),
              ( 'ЖД транспорт', '50', '5', '3', '20', '20000', '300');

INSERT INTO logistics.rate (name,costshipping,additionalcost,costkm,startactiondate,endactiondate,transport_id)
		VALUES ('Апрельский',11.0,15.0,40.0,{d '2018-04-01'},{d '2018-05-01'},1),
  			('Апрельский',11.0,15.0,150.0,{d '2018-04-01'},{d '2018-05-01'},2),
  			('Апрельский',11.0,15.0,30.0,{d '2018-04-01'},{d '2018-05-01'},3),
  			('Майский',10.0,12.0,150.0,{d '2018-05-01'},{d '2018-06-01'},1),
  			('Майский',10.0,12.0,30.0,{d '2018-05-01'},{d '2018-06-01'},2),
  			('Майский',10.0,12.0,150.0,{d '2018-05-01'},{d '2018-06-01'},3);

insert into logistics.boxing (variety, cost) VALUES ('Стандартная', '100'),
('Для хрупких грузов', '500'),
('Водонепроницаемая', '400'),
('Холодильный контейнер', '1000');		

INSERT INTO logistics.node (name, city, address, coordinatex, coordinatey, code) 
             VALUES ( 'Московский', 'Москва', 'Улица Адмирала Руднева, д.10', '55.755773', '37.617761', '1'),
               	( 'Уфимский', 'Уфа', 'Авангардная улица, д.11', '54.734768', '55.957838', '2'),
               	( 'Петербургский', 'Санкт-Петербург', 'Улица Авиаконструктора Микояна, д.12', '59.938806', '30.314278', '3'),
               	( 'Рязанский', 'Рязань', 'Уршакская улица, д.16', '54.619886', '39.744954', '4'),
               	( 'Самаровский', 'Самара', 'Ухтомского переулок, д.15', '53.195533', '50.101801', '5'),
               	( 'Сургутский', 'Сургут', 'Тельмана Эрнста площадь, д.2', '61.256000', '73.384500', '6'),
               	( 'Курский', 'Курск', 'Тимирязевская улица, д.7', '51.730361', '36.192647', '7'),
               	( 'Ростовский', 'Ростов-на-Дону', 'Тихая улица, д.24а', '47.227151', '39.744972', '8'),
               	( 'Омский', 'Омск', 'Ткацкая улица, д.10', '54.989342', '73.368212', '9'),
               	( 'Новосибирский', 'Новосибирск', 'Трехгорный Большой переулок, д.4', '55.028739', '82.906927', '10'),
               	( 'Игаркский', 'Игарка', 'Трехсвятительский Большой переулок, д.1', '67.464900', '86.578000', '11'),
               	( 'Новгородский', 'Нижний Новгород', 'Трехпрудный переулок, д.2', '56.323902', '44.002267', '12'),
               	( 'Филиал г. Братск', 'Братск', 'Трубецкая улица, д.6', '56.151382', '101.634152', '13'),
               	( 'Архангельский', 'Архангельск', 'Тюленева Генерала улица, д.10', '64.539304', '40.518735', '14'),
               	( 'Томский', 'Томск', 'Тюрина улица, д.13', '56.495116', '84.972128', '15'),
               	( 'Нижневартовский', 'Нижневартовск', 'Ленивка улица, д.8', '60.943100', '76.543400', '16');

insert into logistics.transport_node (node_id, transport_id) VALUES 
													(1, 2),
													(1, 3),
													(2, 3),
													(6, 3),
													(8, 3),
													(10, 3),
													(13, 2),
													(14, 2),
													(16, 2);
													

insert into logistics.distance (length, node_id_start, node_id_end) VALUES 
														(635, 1, 3),
														(184, 1, 4),
														(456, 1, 7),
														(418, 2, 5),
														(1253, 2, 6),
														(1113, 2, 9),
														(735, 3, 14),
														(328, 4, 12),
														(697, 4, 5),
														(824, 4, 8),
														(956, 5, 7),
														(935, 6, 11),
														(175, 6, 16),
														(848, 6, 15),
														(697, 6, 9),
														(563, 7, 8),
														(609, 9, 10),
														(743, 9, 15),
														(1178, 10, 13),
														(870, 11, 16),
														(933, 12, 14),
														(1535, 13, 16),
														(691, 15, 16);

INSERT INTO logistics.package (name, envelop, height, width, length, weight, quantity, size) VALUES ('31','0','0.7','0.5','0.3','6.7', '1','1'),
																('12','0','0.2','0.1','0.05','4.1', '1','1'),
																('13','0','0.2','0.2','0.3','4.5', '2','1'),
																('14','1','0','0','0','0', '2','0'),
																('15','0','0.6','0.7','0.2','9.4', '1','1'),
																('16','0','0.05','0.9','0.4','1.6', '2','1'),
																('17','1','0','0','0','0', '2','0'),
																('29','0','0.1','0.15','0.09','2.4', '2','1'),
																('21','0','1.1','0.4','0.3','14.1', '1','1'),
																('27','0','0.8','0.7','0.4','9.3', '2','1'),
																('26','1','0','0','0','0', '2','0'),
																('25','0','1','1','1','17.6', '2','1'),
																('24','0','0.2','0.3','0.1','1.2', '1','0.006'),
																('23','1','0','0','0','0', '2','0'),
																('22','1','0','0','0','0', '2','0'),
																('21','1','0','0','0','0', '2','0');

INSERT INTO logistics.order (name, urgency, ready, plan_date, real_date, cost, shipment_date, contact_information, full_path, 
	recipient_id, rate_id, package_id, boxing_id, node_start_id, node_target_id) VALUES 
('6f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '1 day',now() - interval '1 day','3616', now() - interval '7 day', 'Беликов Александр Алексеевич 89267231650', 'Москва - Авто - Хабаровск','2','1','1',1,1,3),
('5f4f9685-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '1 day',now() - interval '1 day','3616', now() - interval '6 day', 'Беликов Александр Алексеевич 89267231650', 'Ростов-на-Дону - Авто - Воронеж','2','1','2',1,8,10),
('5fdh4681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '1 day','3616', now() - interval '7 day', 'Жарких Руслан Николаевич 89267231650', 'Ростов-на-Дону - Воздушная - Благовещенск','2','1','3',2,8,13),
('5f234y81-db50-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '8 day', 'Жарких Руслан Николаевич 89267231650', 'Омск - Авто - Владивосток','2','1','4',1,9,11),
('5f25h681-db50-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Воздушная - Ростов-на-Дону - Воздушная - Благовещенск','1','1','5',1,1,13),
('5ch5h681-d4jd-404c-a9ca-46c9df938d2e','1','1',now(),now() - interval '1 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Москва - Воздушная - Ростов-на-Дону - Воздушная - Благовещенск','1','1','6',2,1,13),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '1 day','3616', now() - interval '9 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','7',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','8',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '10 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','10',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','11',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '2 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '5 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','13',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '5 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','16',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '3 day','3616', now() - interval '3 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','3','1','1',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','4','1','2',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '3 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','5','1','3',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','6','1','4',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','7','1','5',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','6',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','7',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','3','1','8',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','4','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','5','1','10',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','6','1','11',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','7','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','1','1','13',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','1','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','3','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '1 day','3616', now() - interval '9 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','7',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','8',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '10 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '8 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','10',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '2 day','3616', now() - interval '7 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','11',4,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '2 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '5 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','13',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '6 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '5 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','16',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '3 day','3616', now() - interval '3 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','3','1','1',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '3 day','3616', now() - interval '4 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','4','1','2',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '3 day','3616', now() - interval '3 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','5','1','3',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','6','1','4',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','7','1','5',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','6',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '3 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','1','1','7',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '4 day','3616', now() - interval '7 day', 'Сидоров Петр 89267231650', 'Москва - Авто - Уфа','3','1','8',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','4','1','9',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','5','1','10',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '4 day',now() - interval '4 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','6','1','11',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','7','1','12',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '5 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','1','1','13',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','1','1','14',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '6 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','3','1','15',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','4','1','16',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','1',now() - interval '2 day',now() - interval '5 day','3616', now() - interval '7 day', 'Петров Петр 89267231650', 'Москва - Авто - Уфа','4','1','16',1,1,2);

INSERT INTO logistics.order (name, urgency, ready, plan_date, cost, shipment_date, contact_information, full_path, 
	recipient_id, rate_id, package_id, boxing_id, node_start_id, node_target_id) VALUES 
('5f247v81-d2f0-s44c-a9ca-4ag4gf938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Ростов-на-Дону - Воздушная - Благовещенск','2','1','1',2,8,13),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','2',2,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','1','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','3','1','3',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','4','1','4',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','5','1','5',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','6','1','6',3,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','7','1','7',1,1,2),
('5f2f9681-db50-404c-a9ca-46c9df938d2e','0','0',DATE 'tomorrow','3616', now(), 'Иванов Петр 89267231650', 'Москва - Авто - Уфа','1','1','8',2,1,2);
																
																           

COMMIT;

select * from logistics.node
